In [5]:
import pandas as pd
from pandas import Series, DataFrame

In [6]:
tt=pd.read_csv('C:\wonyoung/titanic.csv')
#1
tt

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
#2 데이터크기 구하기
print(tt.shape)

(891, 12)

In [8]:
#3 결측치가 있는 컬럼
pd.isnull(tt).sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
#4 Pclass 내 종류 갯수
tt['Pclass'].astype('category')

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: category
Categories (3, int64): [1, 2, 3]

In [10]:
tt['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [100]:
#5     #남자/여자 각각 평균 나이
average=tt[['Sex','Age']].groupby('Sex')
average.mean()

              Age
Sex
female  27.915709
male    30.726645

In [88]:
#6     #Fare의 최댓값, 최솟값
faremin=tt['Fare'].min()
faremax=tt['Fare'].max()
print(faremin)
print(faremax)

0.0
512.3292

In [126]:
# 남녀별 Fare의 최댓값 최솟값
print(tt[['Sex','Fare']].groupby('Sex').max())
print(tt[['Sex','Fare']].groupby('Sex').min())

            Fare
Sex
female  512.3292
male    512.3292
        Fare
Sex
female  6.75
male    0.00